
"""
1. 定义：
# f1(P1, P2)
f1:查询天气
p1: 地点，特指中国省市，例如北京市
p2: 时间，年月日格式，yyyy-mm-dd
# f2(p1, p2, p3)
f1:查航班
p1: 地点，特指中国省市，例如北京市
p2: 时间，年月日格式，yyyy-mm-dd
p3: 班次，
# f3(P1, P2, p3)
# f4(p1, p2)
# f5(P1, P2, p3)
# f6(p1, p2)

2. few shot
user: 帮我查询北京的天气
assistent: f1(P1="北京市", P2="2025-12-15")
user: 帮我查询明天天津的天气
assistent: f1(P1="天津市", P2="2025-12-16")

"""

func_list = [
"f1(P1, P2)",
"f2(p1, p2, p3)",
"f3(P1, P2, p3)",
"f4(p1, p2)",
"f5(P1, P2, p3)",
"f6(p1, p2)"
]


system_prompt = """
你是一个查询工具，擅长根据用户给定信息，调用已有工具

# 以下是你可以调用的工具
{tools}

# 以下是一些参考示例
{few_shots}

"""